amazon-ecr-credential-helper
apple-fonts
apple-sf-script-extension-fonts
aws-cli-v2
aws-cli-v2-python-awscrt
bottles
butler
downgrade
flux-bin
gamescope-nvidia
git-open
gitlab-ci-local
gnome-icon-theme
gnome-icon-theme-symbolic
gnome-online-accounts-gtk
icoextract
initool-git
kubecolor
kubesess-bin
mackup
mise-bin
neovim-nightly-bin
nerd-fonts-sf-mono
patool
perl-ansicolumn
pet-bin
proton-ge-custom-bin
python-docopt-ng
python-fvs
python-pathvalidate
python-steamgriddb
qt5-wayland-decorations
ra-multiplex
remote-desktop-manager
sideloader-bin
sublime-merge
thorium-browser-bin
vesktop-bin
vial-appimage
vkbasalt-cli
wine-ge-custom
xinput-gui
yay-bin
zsh-autopair-git
zsh-fast-syntax-highlighting
