apple-fonts
apple-sf-script-extension-fonts
butler
downgrade
electron39-bin
gamescope-nvidia
gcc14
gcc14-libs
ghostty-nightly-bin
ghostty-shell-integration-nightly-bin
ghostty-terminfo-nightly-bin
git-open
gitlab-ci-local
gnome-icon-theme
gnome-icon-theme-extras
gnome-icon-theme-symbolic
helium-browser-bin
kubecolor
kubesess-bin
lib32-gst-plugins-base-libs
lib32-gstreamer
libsoup
mediatek-mt7927-dkms
nerd-fonts-sf-mono
obsidian-cli-git
openai-codex-bin
proton-ge-custom-bin
python-pyqt5-webengine
qadwaitadecorations-qt5
qadwaitadecorations-qt6
qt5-location
qt5-wayland-decorations
qt5-webchannel
qt5-webengine
ra-multiplex
remote-desktop-manager
vial-appimage
vicinae-bin
xinput-gui
yay-bin
zsh-autopair-git
zsh-fast-syntax-highlighting
